#+TITLE: Revision management gem
#+AUTHOR: Cormac Cannon
#+LANGUAGE: en

# Generic properties
# :eval never-export
# ... Prevent auto evaluation of blocks on export. Evaluate them interactively instead
# :results verbatim
# ... Output results verbatim rather than autodetecting (which usually ends up tabular). Override per script using :results tabular
#+PROPERTY: header-args :results verbatim :noweb yes :exports both :eval never-export
# #+PROPERTY: header-args :results verbatim :noweb yes :exports both

# HTML EXPORT SETUP

# 1. Auto-export to html on save (N.B. This doesn't work?)
#    This can be done per-session by calling 'toggle-org-html-export-on-save'
# Local variables:
# eval: (add-hook 'after-save-hook 'org-html-export-to-html t t)
# End:

# 2. Apply a theme
#+SETUPFILE: org-themes/theme-bigblow.setup
# or alternatively #+SETUPFILE: theme-readtheorg.setup

*** Install

#+BEGIN_SRC sh
  bundle install
  bundle exec rake install
#+END_SRC

#+RESULTS:
#+begin_example
Using rake 10.5.0
Using bundler 1.16.0
Using coderay 1.1.2
Using diff-lcs 1.3
Using git 1.3.0
Using method_source 0.9.0
Using pry 0.11.3
Using rubyzip 1.2.1
Using thor 0.19.4
Using revision 1.0.0 from source at `.`
Using rspec-support 3.7.0
Using rspec-core 3.7.0
Using rspec-expectations 3.7.0
Using rspec-mocks 3.7.0
Using rspec 3.7.0
Bundle complete! 5 Gemfile dependencies, 15 gems now installed.
Use `bundle info [gemname]` to see where a bundled gem is installed.
revision 1.0.0 built to pkg/revision-1.0.0.gem.
revision (1.0.0) installed.
#+end_example

** Supported Commands
Run the executable with no arguments to get usage instructions in your console window...

#+BEGIN_SRC sh
  revision
#+END_SRC

#+RESULTS:
#+begin_example
Loading releasable definitions from /home/cormacc/nmd/gem/revision/releasables.yaml ...
Commands:
  revision --version, -v   # print the version
  revision archive         # Archive releasable(s)
  revision build           # Build releasable(s)
  revision changelog       # Display change log on stdout
  revision deploy          # Deploy releasable(s)
  revision help [COMMAND]  # Describe available commands or one specific command
  revision info            # Display info for all defined releasables
  revision major           # Increment major revision index
  revision md5             # Compute md5sums for current build artefacts
  revision minor           # Increment minor revision index
  revision package         # Build and archive releasables
  revision patch           # Increment patch revision index
  revision tag             # Commit the current revision to a local git repo ...

Options:
  [--dryrun], [--no-dryrun]
  [--id=ID]

#+end_example

#+BEGIN_NOTE
The tool can be run from any subfolder of a project root -- it will traverse the tree until it finds
an ancestor containing =releasables.yaml= OR can go no further (in which case it throws an error).
#+END_NOTE

